Revit 2027 API
RouteAnalysisSettings.MinimumLength Property
 The constant storing minimum allowed length of path of travel
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double MinimumLength { get; }
Public ReadOnly Property MinimumLength As Double
	Get
public:
property double MinimumLength {
	double get ();
}
member MinimumLength : float with get
Property Value
Double
See Also
Reference
RouteAnalysisSettings Class
Autodesk.Revit.DB.Analysis Namespace